Revit 2026 API

# ConcreteFinishType Enumeration

---

The enumerated type representing the permitted values for the asset property "ConcreteFinish" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConcreteFinishType
```
```vb
Public Enumeration ConcreteFinishType
```
```cpp
public enum class ConcreteFinishType
```
```fsharp
type ConcreteFinishType
```

| Member name | Value | Description |
| --- | --- | --- |
| Curved | 1 |  |
| Custom | 4 |  |
| Polished | 3 |  |
| Smooth | 2 |  |
| Straight | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace